Section_4_Real_Workload_Validation/Experiment13/data/raw/case-C/sustained-ramp/trial_013/noisy-load.txt
Running 3m test @ http://127.0.0.1:18081/
  2 threads and 50 connections
  Thread calibration: mean lat.: 40.174ms, rate sampling interval: 107ms
  Thread calibration: mean lat.: 40.590ms, rate sampling interval: 108ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    38.26ms   14.07ms 219.01ms   91.06%
    Req/Sec   200.44     32.27   532.00     85.48%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   34.01ms
 75.000%   37.60ms
 90.000%   50.01ms
 99.000%  101.44ms
 99.900%  158.34ms
 99.990%  204.03ms
 99.999%  213.38ms
100.000%  219.13ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      27.647     0.000000            1         1.00
      30.527     0.100000         6890         1.11
      31.519     0.200000        13624         1.25
      32.415     0.300000        20462         1.43
      33.215     0.400000        27264         1.67
      34.015     0.500000        34219         2.00
      34.431     0.550000        37548         2.22
      34.943     0.600000        40906         2.50
      35.551     0.650000        44336         2.86
      36.383     0.700000        47590         3.33
      37.599     0.750000        50985         4.00
      38.431     0.775000        52727         4.44
      39.551     0.800000        54402         5.00
      41.279     0.825000        56093         5.71
      43.359     0.850000        57788         6.67
      46.239     0.875000        59473         8.00
      48.031     0.887500        60318         8.89
      50.015     0.900000        61170        10.00
      52.799     0.912500        62024        11.43
      55.807     0.925000        62865        13.33
      59.583     0.937500        63725        16.00
      61.887     0.943750        64144        17.78
      64.191     0.950000        64568        20.00
      67.199     0.956250        64993        22.86
      70.207     0.962500        65417        26.67
      73.727     0.968750        65847        32.00
      75.967     0.971875        66051        35.56
      78.399     0.975000        66265        40.00
      81.215     0.978125        66478        45.71
      84.735     0.981250        66691        53.33
      89.663     0.984375        66904        64.00
      92.607     0.985938        67010        71.11
      95.423     0.987500        67113        80.00
      98.943     0.989062        67220        91.43
     103.871     0.990625        67325       106.67
     110.143     0.992188        67432       128.00
     113.663     0.992969        67485       142.22
     117.695     0.993750        67538       160.00
     122.303     0.994531        67592       182.86
     127.167     0.995313        67644       213.33
     132.735     0.996094        67700       256.00
     135.295     0.996484        67724       284.44
     137.983     0.996875        67750       320.00
     141.055     0.997266        67777       365.71
     144.639     0.997656        67804       426.67
     147.583     0.998047        67830       512.00
     149.631     0.998242        67843       568.89
     151.039     0.998437        67856       640.00
     154.367     0.998633        67870       731.43
     156.159     0.998828        67883       853.33
     158.847     0.999023        67896      1024.00
     160.639     0.999121        67903      1137.78
     163.967     0.999219        67909      1280.00
     167.679     0.999316        67916      1462.86
     170.239     0.999414        67923      1706.67
     174.591     0.999512        67929      2048.00
     178.047     0.999561        67933      2275.56
     182.399     0.999609        67936      2560.00
     184.191     0.999658        67939      2925.71
     188.927     0.999707        67943      3413.33
     194.303     0.999756        67946      4096.00
     195.071     0.999780        67948      4551.11
     198.143     0.999805        67949      5120.00
     199.167     0.999829        67951      5851.43
     202.879     0.999854        67953      6826.67
     203.775     0.999878        67954      8192.00
     204.031     0.999890        67955      9102.22
     204.543     0.999902        67956     10240.00
     207.743     0.999915        67957     11702.86
     207.871     0.999927        67958     13653.33
     207.871     0.999939        67958     16384.00
     208.767     0.999945        67959     18204.44
     208.767     0.999951        67959     20480.00
     212.479     0.999957        67960     23405.71
     212.479     0.999963        67960     27306.67
     212.479     0.999969        67960     32768.00
     213.375     0.999973        67961     36408.89
     213.375     0.999976        67961     40960.00
     213.375     0.999979        67961     46811.43
     213.375     0.999982        67961     54613.33
     213.375     0.999985        67961     65536.00
     219.135     0.999986        67962     72817.78
     219.135     1.000000        67962          inf
#[Mean    =       38.262, StdDeviation   =       14.067]
#[Max     =      219.008, Total count    =        67962]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  71989 requests in 3.00m, 58.56MB read
Requests/sec:    399.94
Transfer/sec:    333.15KB